README.org
home
====

* Intent

This repository is used to publish my home directory org document. Virtually
all of my development occurs in a private repository. That is responsible for
ongoing, unstable changes. This repository is used to publish a known good and
/working/ version of the system.

It contains everything required to build it but for Emacs. It also contains
tangled and weaved artifacts that this system creates.

* Contents

** Source

- TC3F.org :: the single literate document
- Makefile :: orchestrates the work
- Cask :: defines build requirements
- publish.txt :: notes on how to prepare the system publishing

** Tangled

- .org-mode.emacs.el :: "light weight" configuration just for org-mode
- .emacs.el :: "fully loaded" configuration

** Weaved

- TC3F.
  - txt :: ASCII
  - html :: HTML
  - pdf :: PDF

#  LocalWords:  Makefile
